In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
skytrax = pd.read_excel("skytrax.xlsx")

In [4]:
skytrax.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 131895 entries, 0 to 131894
Data columns (total 17 columns):
airline            65947 non-null object
overall            64017 non-null float64
author             65947 non-null object
review_date        65947 non-null object
customer_review    65947 non-null object
aircraft           19718 non-null object
traveller_type     39755 non-null object
cabin              63303 non-null object
route              39726 non-null object
date_flown         39633 non-null object
seat_comfort       60681 non-null float64
cabin_service      60715 non-null float64
food_bev           52608 non-null float64
entertainment      44193 non-null float64
ground_service     39358 non-null float64
value_for_money    63975 non-null float64
recommended        64440 non-null object
dtypes: float64(7), object(10)
memory usage: 17.1+ MB

In [5]:
skytrax.head()

,airline,overall,author,review_date,customer_review,aircraft,traveller_type,cabin,route,date_flown,seat_comfort,cabin_service,food_bev,entertainment,ground_service,value_for_money,recommended
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Turkish Airlines,7.0,Christopher Hackley,8th May 2019,âœ… Trip Verified | London to Izmir via Istanb...,NaN,Business,Economy Class,London to Izmir via Istanbul,2019-05-01 00:00:00,4.0,5.0,4.0,4.0,2.0,4.0,yes
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Turkish Airlines,2.0,Adriana Pisoi,7th May 2019,âœ… Trip Verified | Istanbul to Bucharest. We ...,NaN,Family Leisure,Economy Class,Istanbul to Bucharest,2019-05-01 00:00:00,4.0,1.0,1.0,1.0,1.0,1.0,no
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Percentage of missing values per column

In [9]:

np.sum(skytrax.isnull())/skytrax.shape[0]

airline            0.500004
overall            0.514637
author             0.500004
review_date        0.500004
customer_review    0.500004
aircraft           0.850502
traveller_type     0.698586
cabin              0.520050
route              0.698806
date_flown         0.699511
seat_comfort       0.539929
cabin_service      0.539672
food_bev           0.601137
entertainment      0.664938
ground_service     0.701596
value_for_money    0.514955
recommended        0.511430
dtype: float64

### Dropping rows with 100% Null values

In [20]:
print("Number of rows with NULL values in all columns :",skytrax.shape[0] - skytrax.dropna(how='all').shape[0] )
skytrax = skytrax.dropna(how='all')

Number of rows with NULL values in all columns : 65948

In [21]:
skytrax.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65947 entries, 1 to 131894
Data columns (total 17 columns):
airline            65947 non-null object
overall            64017 non-null float64
author             65947 non-null object
review_date        65947 non-null object
customer_review    65947 non-null object
aircraft           19718 non-null object
traveller_type     39755 non-null object
cabin              63303 non-null object
route              39726 non-null object
date_flown         39633 non-null object
seat_comfort       60681 non-null float64
cabin_service      60715 non-null float64
food_bev           52608 non-null float64
entertainment      44193 non-null float64
ground_service     39358 non-null float64
value_for_money    63975 non-null float64
recommended        64440 non-null object
dtypes: float64(7), object(10)
memory usage: 9.1+ MB

### Percentage of missing values per column: After removing nulls

In [23]:
np.sum(skytrax.isnull())/skytrax.shape[0]

airline            0.000000
overall            0.029266
author             0.000000
review_date        0.000000
customer_review    0.000000
aircraft           0.701002
traveller_type     0.397167
cabin              0.040093
route              0.397607
date_flown         0.399017
seat_comfort       0.079852
cabin_service      0.079336
food_bev           0.202268
entertainment      0.329871
ground_service     0.403187
value_for_money    0.029903
recommended        0.022852
dtype: float64

### Number of columns with 0% missing value

In [24]:

np.sum(np.sum(skytrax.isnull())/skytrax.shape[0] ==0)

4

### Number of columns with more than 50% missing value

In [26]:
np.sum(np.sum(skytrax.isnull())/skytrax.shape[0] > 0.5)

1

In [27]:
skytrax.head()

,airline,overall,author,review_date,customer_review,aircraft,traveller_type,cabin,route,date_flown,seat_comfort,cabin_service,food_bev,entertainment,ground_service,value_for_money,recommended
1,Turkish Airlines,7.0,Christopher Hackley,8th May 2019,âœ… Trip Verified | London to Izmir via Istanb...,NaN,Business,Economy Class,London to Izmir via Istanbul,2019-05-01 00:00:00,4.0,5.0,4.0,4.0,2.0,4.0,yes
3,Turkish Airlines,2.0,Adriana Pisoi,7th May 2019,âœ… Trip Verified | Istanbul to Bucharest. We ...,NaN,Family Leisure,Economy Class,Istanbul to Bucharest,2019-05-01 00:00:00,4.0,1.0,1.0,1.0,1.0,1.0,no
5,Turkish Airlines,3.0,M Galerko,7th May 2019,âœ… Trip Verified | Rome to Prishtina via Ista...,NaN,Business,Economy Class,Rome to Prishtina via Istanbul,2019-05-01 00:00:00,1.0,4.0,1.0,3.0,1.0,2.0,no
7,Turkish Airlines,10.0,Zeshan Shah,6th May 2019,âœ… Trip Verified | Flew on Turkish Airlines I...,A330,Solo Leisure,Economy Class,Washington Dulles to Karachi,April 2019,4.0,5.0,5.0,5.0,5.0,5.0,yes
9,Turkish Airlines,1.0,Pooja Jain,6th May 2019,âœ… Trip Verified | Mumbai to Dublin via Istan...,NaN,Solo Leisure,Economy Class,Mumbai to Dublin via Istanbul,2019-05-01 00:00:00,1.0,1.0,1.0,1.0,1.0,1.0,no

### Total Airlines

In [33]:
skytrax['airline'].value_counts()

Spirit Airlines             2934
American Airlines           2867
United Airlines             2829
British Airways             2811
Cathay Pacific Airways      2402
Air Canada rouge            2192
Emirates                    1786
China Southern Airlines     1722
Frontier Airlines           1624
Ryanair                     1566
Delta Air Lines             1547
Turkish Airlines            1491
Qatar Airways               1445
Lufthansa                   1421
Air India                   1382
Qantas Airways              1362
Air China                   1354
Etihad Airways              1290
Air Canada                  1281
Norwegian                   1156
Singapore Airlines          1064
easyJet                     1041
KLM Royal Dutch Airlines     978
Vueling Airlines             965
Air France                   932
Southwest Airlines           913
TAP Portugal                 848
Thai Airways                 795
Wizz Air                     746
Garuda Indonesia             744
                            ...
Asiana Airlines              447
Aeromexico                   437
Brussels Airlines            422
Ethiopian Airlines           420
LOT Polish Airlines          404
South African Airways        395
airBaltic                    362
Bangkok Airways              356
Egyptair                     329
Virgin America               310
Avianca                      306
Ukraine International        306
Pegasus Airlines             296
Gulf Air                     277
Kuwait Airways               270
IndiGo                       267
Royal Air Maroc              265
Eurowings                    264
Royal Jordanian Airlines     263
Saudi Arabian Airlines       245
LATAM Airlines               227
Copa Airlines                218
flydubai                     201
Germanwings                  144
TAROM Romanian               133
QantasLink                   105
Adria Airways                 85
Air Arabia                    80
Tunisair                      71
Thai Smile Airways            48
Name: airline, Length: 81, dtype: int64

### Top Routes of Airlines

In [35]:
skytrax['route'].value_counts()

Bangkok to Hong Kong                    35
BKK to LHR                              32
LHR to JFK                              30
Vancouver to Toronto                    30
Hong Kong to Bangkok                    28
Singapore to Bangkok                    28
LHR to BKK                              27
HKG to LHR                              26
Guangzhou to New York                   26
Hong Kong to London                     25
LHR to HKG                              24
Singapore to Hong Kong                  23
Jakarta to Singapore                    23
London to Bangkok                       23
Singapore to Sydney                     23
Singapore to Jakarta                    23
Bangkok to Singapore                    22
London to Hong Kong                     22
Guangzhou to Auckland                   22
Auckland to Sydney                      22
Melbourne to Sydney                     22
Barcelona to Gatwick                    21
Guangzhou to Sydney                     21
Toronto to Las Vegas                    21
Sydney to Melbourne                     21
JFK to LHR                              20
Toronto to Vancouver                    20
Bangkok to London                       20
CAN to LAX                              20
Sydney to Singapore                     20
                                        ..
CDG to SLC                               1
Baku to Frankfurt via Budapest           1
MKE to LaGuardia                         1
Doha to Alexandria                       1
Los Angeles to Guiyang via Guangzhou     1
Toronto to Lahore via Jeddah             1
Geneva to Baltimore via Keflavik         1
LHR to MCT via BAH                       1
Nanjing to Hong Kong                     1
Rome to Edinburgh via Amsterdam          1
Washington to Frankfurt via London       1
Penang to Copenhagen via Doha            1
DEL to NBO via ADD                       1
Nanchang to Paris via Guangzhou          1
CGK to LBJ via DPS                       1
XIY to PEK                               1
Budapest to Nuremberg                    1
MCO to STL                               1
Hong Kong to Copenhagen via Zurich       1
Helsinki to Chicago O'Hare               1
Denver to Boston via Charlotte           1
JFK to LGW via KBP                       1
CAN to DPS                               1
Stockholm to Bangkok via Istanbul        1
Tampa, FL to Vienna, Austria             1
Mumbai to Dehradun via Delhi             1
MNL to LHR via DOH                       1
Toronto to Oslo via London               1
Orlando to Honolulu via Phoenix          1
ORD to CVG                               1
Name: route, Length: 24549, dtype: int64

### Working with only US Domestic Airlines

In [48]:
skytrax['airline'] in ('American Airlines', 'Delta Air Lines', 'Southwest Airlines', 
                        'United Airlines','Jetblue Airways', 'Frontier Airlines', 'Spirit Airlines')]

SyntaxError: invalid syntax (<ipython-input-48-d6c92de5f3be>, line 2)

In [52]:
skytrax.filter(like='Spirit', axis=0)

Empty DataFrame
Columns: [airline, overall, author, review_date, customer_review, aircraft, traveller_type, cabin, route, date_flown, seat_comfort, cabin_service, food_bev, entertainment, ground_service, value_for_money, recommended]
Index: []

In [ ]:
skytrax[]

In [15]:
skytrax.dropna(how='all').shape[0]

65947

In [16]:
skytrax.shape[0]

131895

In [17]:
131895-65947

65948

In [81]:
a = skytrax[['airline']].head(10)
a

             airline
1   Turkish Airlines
3   Turkish Airlines
5   Turkish Airlines
7   Turkish Airlines
9   Turkish Airlines
11  Turkish Airlines
13  Turkish Airlines
15  Turkish Airlines
17  Turkish Airlines
19  Turkish Airlines

In [65]:
for name in a.airline:
    x, y = name.split(' ')
    print(x,y)

Turkish Airlines
Turkish Airlines
Turkish Airlines
Turkish Airlines
Turkish Airlines
Turkish Airlines
Turkish Airlines
Turkish Airlines
Turkish Airlines
Turkish Airlines

In [82]:
a

             airline
1   Turkish Airlines
3   Turkish Airlines
5   Turkish Airlines
7   Turkish Airlines
9   Turkish Airlines
11  Turkish Airlines
13  Turkish Airlines
15  Turkish Airlines
17  Turkish Airlines
19  Turkish Airlines

In [83]:
a['x'], a['y'] = a['airline'].str.split(' ').str

In [84]:
a

             airline        x         y
1   Turkish Airlines  Turkish  Airlines
3   Turkish Airlines  Turkish  Airlines
5   Turkish Airlines  Turkish  Airlines
7   Turkish Airlines  Turkish  Airlines
9   Turkish Airlines  Turkish  Airlines
11  Turkish Airlines  Turkish  Airlines
13  Turkish Airlines  Turkish  Airlines
15  Turkish Airlines  Turkish  Airlines
17  Turkish Airlines  Turkish  Airlines
19  Turkish Airlines  Turkish  Airlines

In [71]:
a['airline'].str.split(' ', 1)

1     [Turkish, Airlines]
3     [Turkish, Airlines]
5     [Turkish, Airlines]
7     [Turkish, Airlines]
9     [Turkish, Airlines]
11    [Turkish, Airlines]
13    [Turkish, Airlines]
15    [Turkish, Airlines]
17    [Turkish, Airlines]
19    [Turkish, Airlines]
Name: airline, dtype: object

In [74]:
a['airline'].str.split(' ', 1).str

In [94]:
skytrax.overall

1          7.0
3          2.0
5          3.0
7         10.0
9          1.0
11         2.0
13         1.0
15         2.0
17         6.0
19         1.0
21         1.0
23         1.0
25         1.0
27         1.0
29         2.0
31         3.0
33         8.0
35         5.0
37         7.0
39         7.0
41         8.0
43         1.0
45         1.0
47         4.0
49         2.0
51         1.0
53        10.0
55         2.0
57         5.0
59         8.0
          ...
131836    10.0
131838    10.0
131840     1.0
131842     9.0
131844     6.0
131846    10.0
131848    10.0
131850     8.0
131852     8.0
131854     8.0
131856     8.0
131858     4.0
131860     8.0
131862     5.0
131864     8.0
131866     1.0
131868     2.0
131870     3.0
131872     2.0
131874     3.0
131876     3.0
131878     3.0
131880     4.0
131882     3.0
131884     NaN
131886     NaN
131888     NaN
131890     NaN
131892     NaN
131894     NaN
Name: overall, Length: 65947, dtype: float64

In [91]:
import math as m
import numpy as np

In [95]:
np.mean(skytrax.overall)

5.145430120124342

In [96]:
np.std(skytrax.overall)

3.477504636785173